
## Plan Result




<pre><code>Plan: 5 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.hmc_to_ia_hearings_api_servicebus-connection-string
  * azurerm_key_vault_secret.ia-hmc-servicebus-shared-access-key-tf
  * azurerm_resource_group.rg
  * azurerm_servicebus_subscription_rule.topic_filter_rule_et
  * module.servicebus-subscription.azurerm_servicebus_subscription.servicebus_subscription


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.hmc_to_ia_hearings_api_servicebus-connection-string will be created
  + resource "azurerm_key_vault_secret" "hmc_to_ia_hearings_api_servicebus-connection-string" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ia-aat/providers/Microsoft.KeyVault/vaults/ia-aat"
      + name                    = "hmc-servicebus-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.ia-hmc-servicebus-shared-access-key-tf will be created
  + resource "azurerm_key_vault_secret" "ia-hmc-servicebus-shared-access-key-tf" {
      + content_type            = "secret"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ia-aat/providers/Microsoft.KeyVault/vaults/ia-aat"
      + name                    = "hmc-servicebus-shared-access-key-tf"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "immigration"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/ia-hearings-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#ia-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Immigration"
          + "source"              = "Vault /subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ia-aat/providers/Microsoft.KeyVault/vaults/ia-aat"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "ia-hearings-api-aat"
      + tags     = (known after apply)
    }

  # azurerm_servicebus_subscription_rule.topic_filter_rule_et will be created
  + resource "azurerm_servicebus_subscription_rule" "topic_filter_rule_et" {
      + filter_type                    = "CorrelationFilter"
      + id                             = (known after apply)
      + name                           = "hmc-servicebus-aat-subscription-rule-BFA1"
      + sql_filter_compatibility_level = (known after apply)
      + subscription_id                = (known after apply)

      + correlation_filter {
          + properties = {
              + "hmctsServiceId" = "BFA1"
            }
        }
    }

  # module.servicebus-subscription.azurerm_servicebus_subscription.servicebus_subscription will be created
  + resource "azurerm_servicebus_subscription" "servicebus_subscription" {
      + auto_delete_on_idle                       = "P10675199DT2H48M5.4775807S"
      + client_scoped_subscription_enabled        = false
      + dead_lettering_on_filter_evaluation_error = true
      + dead_lettering_on_message_expiration      = true
      + default_message_ttl                       = "P10675199DT2H48M5.4775807S"
      + enable_batched_operations                 = false
      + id                                        = (known after apply)
      + lock_duration                             = "PT1M"
      + max_delivery_count                        = 10
      + name                                      = "hmc-ia-subs-to-cft-aat"
      + requires_session                          = false
      + status                                    = "Active"
      + topic_id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/topics/hmc-to-cft-aat"
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":160,"Program":"tfcmt","SHA1":"","Vars":{}} -->